perf/artillery.yaml
config:
  plugins:
    statsd: {
      "host": "localhost",
      "port": 8125,
      "prefix": "artillery"
    }
  target: "http://localhost:3000"
  http:
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections
  phases:
    - duration: 60
      arrivalRate: 5
    #- duration: 120
    #  arrivalRate: 5
    #  rampTo: 50
    #- duration: 600
    #  arrivalRate: 50
  payload:
      path: "perf.csv"
      fields:
        - "date"
        - "cityId"
  environments:
    production:
      target: "http://wontresolve.prod:44321"
      phases:
        - duration: 120
          arrivalRate: 10
    staging:
      target: "http://127.0.0.1:3003"
      phases:
        - duration: 1200
          arrivalRate: 20
scenarios:
    - name: "Week schedule"
      flow:
        - loop:
            - get:
                url: "/api/mass/week?date={{ date }}"
                cookie:
                    cityId: "{{ cityId }}"
        #- count: 50