perf/artillery.yaml
config:
  plugins:
    statsd: {
      "host": "localhost",
      "port": 8125,
      "prefix": "artillery"
    }
  target: "http://localhost:3000"
  http:
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections
  phases:
    - duration: 10
      arrivalRate: 2
  payload:
      path: "perf.csv"
      fields:
        - "date"
        - "cityId"
scenarios:
    - name: "Week schedule"
      flow:
        - loop:
            - get:
                url: "/api/mass/week?date={{ date }}"
                cookie:
                    cityId: "{{ cityId }}"