perf/artillery.yaml
config:
  plugins:
    statsd: {
      "host": "localhost",
      "port": 8125,
      "prefix": "artillery"
    }
#    expect: {}
  target: "https://api.imsha.by"
  http:
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections
  phases:
    - duration: 120
      arrivalRate: 2
      rampTo: 5
      name: "Warm up the application"
    - duration: 600
      arrivalRate: 5
      name: "Sustained max load"

    - duration: 10
      arrivalRate: 2
  payload:
      path: "perf.csv"
      fields:
        - "date"
        - "cityId"
scenarios:
    - name: "Week schedule"
      flow:
        - get:
            url: "/api/mass/week?date={{ date }}"
            cookie:
                cityId: "{{ cityId }}"
#            expect:
#              - statusCode: 200
#              - contentType: json
#              - hasProperty: schedule